//====================================================================
//
//ライト処理[light.h]
//author KOMURO HIROMU
//
//====================================================================
#ifndef _LIGHT_H_		//このマクロ定義がされてなかったら

#define _LIGHT_H_		//二重インクルード防止のマクロを定義する
//マクロ定義
#define MAX_LIGHT			(3)
//---------------------------------------------------------------------------
//					*****			オブジェクトクラスの定義			*****
//---------------------------------------------------------------------------
class CLight
{
public:
	CLight();
	~CLight();
	// メンバ関数
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
private:

	D3DLIGHT9 m_alight[MAX_LIGHT];		//ライトの情報
};
#endif
